#include <iostream>
using namespace std;

int main() {
    setlocale(0, "");

    //1 задание
    cout << "1 задание, определие символа\n";
    char ch;    
    int code;

    cout << "Введите символ: ";
    cin >> ch;

    code = (int)ch;

    if (((code >= 65) && (code <= 90)) || ((code >= 97) && (code <= 122))) {
        cout << "буква\n";
    }
    else if ((code >= 48) && (code <= 57)) {
        cout << "цифра\n";
    }
    else if ((code == 33) || ((code >= 44) && (code <= 46)) ||
        (code == 58) || (code == 59) || (code == 63)) {
        cout << "знак препинания\n";
    }
    else {
        cout << "другой символ\n";
    }

	// 2 задание
    cout << "\n2 задание,подсчет стоимости разговора\n";

    int a, b, c;             
    float x, y, z;           
    x = 2.0;               
    y = 3.0;                 
    z = 2.5;               

    cout << "Операторы:\n";
    cout << "1 — MTS\n";
    cout << "2 — Megafon\n";
    cout << "3 — Beeline\n";

    cout << "Введите свой оператор: ";
    cin >> a;
    cout << "Введите оператор собеседника: ";
    cin >> b;
    cout << "Введите длительность разговора (мин): ";
    cin >> c;

    if (a == b) {
        cout << "Звонки внутри сети бесплатны\n";
    }
    else if (a == 1) {
        cout << "Стоимость разговора: $" << c * x << endl;
    }
    else if (a == 2) {
        cout << "Стоимость разговора: $" << c * y << endl;
    }
    else if (a == 3) {
        cout << "Стоимость разговора: $" << c * z << endl;
    }
    else {
        cout << "Ошибка: такого оператора нет\n";
    }

	//3 задание
    cout << "\3 задание\n";

    int mode;            
    int a1, a2, a3, a4;  
    float p, t;           
    p = 0.5;
    a4 = 0;

    cout << "Выберите действие:\n";
    cout << "1 — введен желаемый доход: счет кол-ва строк\n";
    cout << "2 — введены строки кода и желаемый обьем зарплаты: найти кол-во опозданий\n";
    cout << "3 — введены строки и кол-во опозданий: найти зарплату\n";
    cin >> mode;

    switch (mode) {
       
    case 1:
        cout << "Введите желаемый доход: ";
        cin >> a1;
        cout << "Введите количество опозданий: ";
        cin >> a2;

        a3 = a1 / p; 
        if (a2 >= 3) {
            a4 = (a2 / 3) * 20;           
            a3 = a3 + (a4 / p);           
        }
        cout << "Васе нужно написать " << a3 << " строк кода.\n";
        break;

    case 2:
        cout << "Введите желаемый доход ($): ";
        cin >> a1;
        cout << "Введите количество строк кода: ";
        cin >> a3;
        t = a3 * p;

        if (a1 >= t) {
            cout << "Опаздывать нельзя\n";
        }
        else {
            a2 = (t - a1) / 20 * 3;
            cout << "Можно опоздать " << a2 << ", " << a2 + 1 << " или " << a2 + 2 << " раза.\n";
        }
        break;

    case 3:
        cout << "Введите количество строк кода: ";
        cin >> a3;
        cout << "Введите количество опозданий: ";
        cin >> a2;
        t = a3 * p;

        if (a2 >= 3) {
            a4 = (a2 / 3) * 20;
            if (a4 >= t) {
                cout << "Вася ничего не получит\n";
            }
            else {
                a1 = t - a4;
                cout << "Вася получит $" << a1 << endl;
            }
        }
        else {
            cout << "Вася получит $" << t << endl;
        }
        break;

    default:
        cout << "Ошибка: неправильный пункт меню\n";
    }

    return 0;
}
